const quickAppPrivacyAgreement = (
  appName: string,
) => ` ”快应用是由深圳市漫城科技开发有限公司（以下简称“我们”或“我司”）为您提供的一款快应用产品（以下简称“本快应用”）。
      基本业务功能是电子图书
      ，为用户提供小说阅读、名著资源，并且提供添加书架、删除书架、福利中心礼品兑换等功能。
      我们十分尊重您的个人信息和数据，并会尽全力保护您的个人信息和数据的安全可靠。
      我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
      请在使用我们的快应用产品（或服务）前，仔细阅读并了解本快应用隐私政策（以下简称“本政策”）。如对本政策内容有任何疑问、意见或建议，您可通过本政策文末的联系方式与我们联系。如您选择使用或继续使用我们的服务，即意味着您同意并认可本政策。
      一、我们如何收集和使用您的个人信息 二、我们如何共享、转让、公开披露您的个人信息
      三、我们如何存储您的个人信息 四、您的权利 五、如何清除快应用缓存和关闭快应用 六、未成年人保护
      七、第三方共享信息清单 八、本隐私政策的修订和通知 九、如何联系我们 十、其他
      一、我们如何收集和使用您的个人信息
      （一）我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：
      1、为您展示和推送信息以及保障快应用服务的安全运行、运营质量及效率
      我们可能会收集您的信息，包含您的设备信息、并将该等信息储存为日志信息，用于记住您的身份、分析您使用我们服务的情况、优化广告投放，以及保障快应用与服务的安全运行、运营的质量及效率。您可以通过手机设置拒绝或管理该类技术的使用。
      我们仅在以下场景收集您的信息：
      （1）在您进入应用时，我们会采集您的可变的唯一设备识别码（AndroidID）、IP地址作为日志上报；
      （2）在您主动进行意见反馈时，我们会采集您的意见信息、联系方式(自愿填写)作为日志上报；
      （3）在您进行奖品兑换、主动填写联系方式时，我们会采集您的可变的唯一设备识别码（AndroidID）、IP地址作为日志上报；
      （4）在您主动查看广告时，我们会采集您的可变的唯一设备识别码（AndroidID）、IP地址作为日志上报。
      同时，我们收集了可变的唯一设备识别码（AndroidID）、SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、独立设备标识符、安卓广告主标识符、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、时区和网络状态（WiFi等）等。所有信息收集皆会在您同意的前提下进行，且仅用于实现推广活动、信息的推送以及保障快应用与服务的安全运行、运营的质量及效率。
      2、改善我们产品或服务
      我们可能会获取您的其他信息，包括您的客服反馈信息、提供给我方的联系方式等，以便改善我们的内容推荐、广告推荐等服务。
      3、福利中心的礼品兑换
      当您满足产品内福利中心的兑换规则，有兑换意愿时，您可以主动在产品中提交兑换信息。为了您及时收到自己兑换的福利礼品，我们将会收集您主动提交的联系人、联系方式、收货地址，并仅限于邮寄使用。
      4、我们如何使用您的信息
      请您了解：本快应用无需您提供必要个人信息即可为您提供基本业务功能。在您使用福利中心功能兑换奖品，投诉等功能时，需要您提供的个人信息为非必要个人信息，包括：您的姓名，电话，地址等信息。对于非必要的个人信息，您可以选择不提供、或随时取消您就非必要个人信息向我们提供的授权，这并不会影响您使用我们的各项基本业务功能。
      如果我们将您的信息用于本《隐私政策》中未载明的其他用途，会事先征求您统一。但是，根据相关法律法规及国家标准，我们可能会共享、转让、公开披露个人信息而无需事先征得您的授权同意，具体内容详见“二、我们如何共享、转让、公开披露您的个人信息”。
      （二）请您知悉，以下情形中，我们收集、使用个人信息无需征得您的授权同意：
      1、依照国家有关法律、法规规定，与国家安全、公共安全、重大公共利益有关的；
      2、与刑事侦查、起诉、审判和判决执行等有关的； 3、查找、预防或处理欺诈、安全或技术方面问题的；
      4、执行适用的服务条款（包括调查可能存在的违规情况）的；
      5、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但难以得到本人同意的；
      6、所收集的个人信息是主体自行向社会公众公开的；
      7、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道，但是您明确拒绝或者处理该信息侵害您重大利益的除外；
      8、根据您的要求签订合同所必需的； 9、法律法规规定的其他情形。
      特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时，或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，则在结合使用期间，这些信息将作为您的个人信息按照本隐私政策处理与保护。
      （三）应用权限说明
      1、为保障本快应用相关产品或服务能实现与安全稳定运行之目的，我们可能会申请或使用操作系统的相关权限；
      2、为保障您的知情权，我们通过下列列表将产品或服务可能申请、使用的相关操作系统权限进行展示，您可以根据实际需要对相关权限进行管理；
      安卓操作系统应用权限列表
      权限名称权限功能说明使用场景或目的android.permission.INTERNET访问网络权限实现应用程序联网
      （四）收集、使用个人信息目的变更的处理
      请您了解，随着我们业务的发展，可能会对本产品的功能和提供的服务有所调整变化。原则上，当新功能或服务原业务场景相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知，并征得您的同意。
      二、我们如何共享、转让、公开披露您的个人信息 （一）共享
      尊重用户个人隐私是我们的一项基本原则。我们不会将您的个人信息向以外的任何公司、组织和个人共享，但以下情况除外：
      1、在获得您（以及监护人）明确同意或授权或您主动选择的情况下共享。
      2、在法定情形下的共享。我们可能会根据法律法规的规定、诉讼争议的需要或者按行政、司法机关依法提出的要求，对外共享您的个人信息。
      3、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由我们和授权合作第三方快应用共同提供。我们可能会与第三方快应用共享为您提供服务所必要的去标识化的设备信息，以及基于去标识化设备信息的统计信息。您理解，仅凭借这些信息本身无法识别您的特定身份或者与您相关联，但这些信息将帮助我们分析、衡量广告和相关服务的有效性，以提供更好的客户服务和用户体验。请注意，第三方快应用可能因为其版本升级、策略调整等原因导致数据处理类型存在一定变化，请以其公示的官方说明为准。
      为实现广告推送，与服务快应用提供商（如vivo广告联盟、百度广告联盟等）共享您去标识化或匿名化后的设备、网络、渠道、广告点击、浏览、展示以及广告转化数据等信息，用于分析、衡量、提升广告相关服务的有效性，以实现广告投放、优化等目的。
      （二）转让 我们不会将您的个人信息转让给任何公司、组织或者个人，但下列情况除外：
      1、在获得明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
      2、发生合并、收购、资产转让等交易导致向第三方分享您的个人信息时，我们将通过推送通知、公告等形式告知您相关情形，按照法律法规及不低于本政策所要求的标准继续保护或要求新的管理者继续保护您的个人信息。
      （三）公开披露 1、在您明确同意的披露方式下披露您所指定的个人信息。
      2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。
      （四）请您知悉，在下列情形中，根据法律法规或相关国家标准，我们共享、转让、公开披露您的个人信息无需征得您的授权同意：
      1、依照国家有关法律、法规规定，与国家安全、公共安全、重大公共利益有关的；
      2、与刑事侦查、起诉、审判和判决执行等有关的； 3、查找、预防或处理欺诈、安全或技术方面问题的；
      4、执行适用的服务条款（包括调查可能存在的违规情况）的；
      5、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但难以得到本人同意的；
      6、所收集的个人信息是主体自行向社会公众公开的；
      7、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道，但是您明确拒绝或者处理该信息侵害您重大利益的除外；
      8、根据您的要求签订合同所必需的；
      9、用于维护所提供的产品或服务的安全稳定运行所必须的，例如发现、处置产品或服务的故障；
      10、法律法规规定的其他情形。 三、我们如何存储和保护您的个人信息 （一）信息存储
      我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内，不会进行任何数据出境。我们仅在本政策所述目的所必需期间和法律法规及监管要求的期限内保存您的个人信息。如届时您已经不再使用服务的，我们将及时删除您的个人信息。
      （二）信息保护
      1、我们将认真履行保护您的个人信息的责任，以避免对您的个人信息造成丢失、误用或非授权访问。我们将按照适用的隐私和数据安全方面的法律，采取合理且可行的技术、物理、法律和组织措施来确保您的个人信息的安全性。
      2、为保障您的信息安全，我们致力于使用各种安全技术及配套的管理体系来尽量降低您的信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。例如：使用加密传输技术、信息加密存储、严格限制数据中心的访问、使用专用网络通道及网络代理等。
      3、尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全。
      4、我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以提供系统等形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
      5、如发生以下不可抗力情形，我司不承担任何责任，但本公司将尽最大努力维护您的权益，并将及时通知到您：
      （1）黑客攻击； （2）电信运营商导致之重大影响； （3）因政府管制而造成网络、网站关闭；
      （4）病毒侵袭； （5）自然灾害、战争等其他不能合理控制、不可预见或即使预见亦无法避免的事件。
      6、我们谨此特别提醒您，本隐私政策提供的个人信息保护措施仅适用于本快应用及相关服务。一旦您离开本快应用及相关服务，浏览或使用其他网站、服务及内容资源，我们即没有能力及义务保护您在本快应用及相关服务之外的快应用、网站提交的任何个人信息，无论您登录、浏览或使用上述快应用、网站是否基于本快应用的链接或引导。
      四、您的权利 （一） 查询、更正、获取您个人信息副本
      您可以在“我的”页面，拨打客服电话0755-86532181进行查询、更正、获取您个人信息副本。 （二）
      撤回您授权同意的范围
      每个业务功能需要一些基本的个人信息才能够得以完成，具体请见本政策第一条。对于额外个人信息的收集和使用，您可以点击相应按钮以示同意，或要求更改您授权同意的范围。需要特别注意的是，当您在首次使用同意隐私政策和用户协议后，后续再次打开或者使用时，我们将不会进行二次询问。您可以在产品中“我的—“清除缓存””撤回您的授权。
      （三）永久停用的权利
      快应用不同于传统的手机软件，无需下载和安装。因此当您不需要时，您不再打开即可。同时，您可以在产品中“我的”—“永久停用”选择永久停用，避免误操作再次打开。
      （四）停止运营向您告知
      如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。
      （五）访问隐私政策 您可以在快应用内的“我的”-“隐私政策”查看本隐私政策的全部内容。
      请您了解，本隐私政策中所述的相关服务可能会根据您所使用的手机型号、系统版本、快应用应用程序版本、移动客户端等因素而有所不同。最终的产品和服务以您所使用的快应用及相关服务为准。
      （六）投诉举报
      您可以按照我们公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您可以在“我的”页面，拨打客服电话0755-86532181，或点击“投诉反馈”来联系我们，我们将在3个工作日内认真处理您的问题。
      五、如何清除快应用缓存和关闭快应用 （一）如何清除快应用缓存？ 1、vivo
      打开设置，选择应用与权限，点击应用管理，选择需要清理缓存的快应用，“存储”-“清除缓存”。 2、oppo
      打开设置，选择应用管理，点击应用列表，打开快应用-存储占用-清除缓存。 3、华为
      设置-应用和服务-应用管理-选择需要清理缓存的快应用-存储-清空缓存。 4、小米
      设置-应用设置-应用管理-选择需要清理缓存的快应用-存储占用-清除数据-清除缓存。
      （二）如何关闭跳转快应用 1、vivo
      设置-搜索“快应用”-进入快应用管理-快应用跳转管理-关闭【APP跳转快应用】。 2、oppo
      快应用中心-点开我的-我的设置-隐私-点击撤回个人信息保护政策同意-点击撤回同意并退出即可。
      3、华为
      应用市场-管理-快应用管理-点击我的-设置-点击关于-菜单中点击【停止快应用中心服务】即可关闭快应用。
      4、小米 设置-搜索快应用-找到隐私设置，打开-点击撤回同意并撤回。 六、未成年人保护
      本快应用非常重视对未成年人个人信息的保护。
      1、根据相关法律法规的规定，如您是18周岁以下的未成年人，在使用本快应用功能或服务前，应在您的监护人监护、指导下共同阅读并自主决定是否同意本政策，并由您的监护人帮助您完成注册流程，以便您能使用本快应用功能或服务；如您是未成年人的监护人，当您在帮助未成年人完成注册、使用前，应当仔细阅读并自主决定是否同意本政策。
      2、特别地，如果您是14周岁以下儿童的，在使用本快应用功能或服务前，您应请您的监护人仔细阅读，确保在取得监护人同意后，您才可在监护人的指导下使用本快应用功能或服务；如您是未满14周岁的儿童的监护人，应当仔细阅读，决定是否同意本政策并帮助儿童进行注册、使用，以便儿童能使用本快应用功能或服务。只有在征得监护人对本政策的同意后，14周岁以下的儿童方可使用本快应用提供的功能或服务。为加强对儿童个人信息的保护，除遵循本政策项下的其他规定外，本快应用将遵循正当必要、知情同意、目的明确、安全保障、依法利用的原则，根据国家相关法律法规及本政策的规定保护儿童的个人信息。
      3、如您对您所监护的未成年人的个人信息保护有相关疑问或权利请求时，请通过本政策中披露的联系方式与本快应用联系。本快应用会在合理的时间内处理并回复您。如监护人发现相关未成年人个人信息为未成年人自行填写，需要进行修改或删除处理的，请随时与我们联系。
      七、第三方共享信息清单 第三方SDK列表说明
      为保障本快应用相关功能的实现和应用的安全稳定运行，我们会接入由第三方提供的软件开发包（SDK）实现该目的。
      我们会对第三方SDK进行严格的安全检测，并要求合作伙伴采取严格的措施来保护你的个人数据。在满足新的服务需求及业务功能变更时，我们可能会调整我们接入的第三方SDK，并及时在本说明中向你公开说明接入第三方SDK的最新情况。请注意，第三方SDK可能因为版本升级、策略调整等原因导致数据类型存在一些变化，附其官方网站链接或相关隐私保护说明链接供参考，具体请以其公示的官方说明为准。
      安卓操作系统第三方SDK列表
      产品/类型使用目的使用场景个人信息收集类型收集方式第三方公司名称隐私保护说明oppo广告广告投放用于消息推送用户账号相关促销活动、消息提醒更新时网路身份识别信息（IP地址）、已安装应用列表、快应用版本号、快应用签名、快应用包名、设备连接信息（电信运营商、网络环境）、设备属性信息（设备型号、操作系统版本、设备地理位置、AndroidID、OAID、IMEI、MAC地址、OpenID、设备SN码SDK本机采集，不涉及数据共享广东欢太科技有限公司https://u.oppomobile.com/main/privacy.htmlvivo广告广告投放用于消息推送用户账号相关促销活动、消息提醒更新时厂商，型号，系统版本，手机imei，手机android
      id，设备WIFI网卡MAC地址，ip地址，手机产品序列号，ICCID，MEID，IMSI、Android
      10唯一标识符，开发者标识等信息SDK本机采集，不涉及数据共享广东天宸网络科技有限公司https://adnet.vivo.com.cn/home/faq华为广告广告投放用于消息推送用户账号相关促销活动、消息提醒更新时设备及使用信息：设备标识符、操作系统的设置信息、设备的硬件信息、应用的基本信息及使用信息、网络信息、运营商信息、华为帐号信息。SDK本机采集，不涉及数据共享华为软件技术有限公司https://developer.huawei.com/consumer/cn/doc/distribution/monetize/yinsishengming-0000001085219712小米广告广告投放用于消息推送用户账号相关促销活动、消息提醒更新时设备标识符（IMEI、OAID、AAID、UDID、VAID、Android
      ID、MAC地址、IMSI）、设备基础信息（设备型号、操作系统、IP地址、屏幕宽高、屏幕密度、Android版本号、SDK版本、MIUI版本号、 MIUI版本名称、系统语言、UserAgent、手机地区、国家编码、国家名称）、WiFi状态、移动运营商、网络类型、网络连接状态、应用包名、版本号、运行中App的进程列表、广告位ID、广告数量、对广告的展示、点击及转化等交互数据。SDK本机采集，不涉及数据共享深圳小米信息技术有限公司https://dev.mi.com/console/doc/detail?pId=2630Topon(广告聚合)广告投放调整广告投放策略和分析广告行为(如广告加载、展示、点击等）唯一设备识别(IMEI/ANDROIDID/等）、Mac地址、IP地址、安卓匿名设备标识符
      (OAID/AID/AAID等）、gaid(google advertising
      id)、SDK或API版本、平台、时间戳、系统文件的创建时间、应用标识符、设备型号、user_agent信息、屏幕方向、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、移动网络/国家代码、时区和网络信息(WiFi或基站信息等）等SDK本机采集，不涉及数据共享广州塔酷信息科技有限公司https://docs.toponad.com/#/zh-cn/android/NetworkAccess/SDK_Policy/sdk_policy_access
      八、隐私政策的修订和通知
      （一）为了给您提供更好的服务，本快应用及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，该修订构成本隐私政策的一部分并具有等同于本隐私政策的效力。但未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。
      （二）本隐私政策更新后，我们会在本快应用，并在更新后的条款生效前以适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。如您继续使用我们的服务，表示同意接受修订后的本政策的内容，但是如果更新的内容需要联系方式、地理位置等个人敏感信息，仍会再次以显著方式征求您的同意。
      （三）对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信、私信或在浏览页面做特别提示等方式，说明隐私政策有变更，请您重新认真阅读）。本隐私政策所指的重大变更包括但不限于：
      1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；
      2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有权变更等；
      3、个人信息共享、转让或公开披露的主要对象发生变化；
      4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
      5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。
      （四）如该等修订造成您在本政策下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本政策的约束。
      九、如何联系我们
      ${appName}由深圳市漫城科技开发有限公司，如果你对个人信息保护问题有投诉、建议、疑问或意见，或者使用过程中有任何问题，您可以在工作时间拨打0755-86532181与我们取得联系，我们会在3个工作日内处理您的问题。
      十、其他
      （一）本“隐私政策”中的标题仅为方便及阅读而设，并不影响本隐私政策中任何规定的含义或解释。
      （二）本“隐私政策”相关词语释义：
      1.本快应用及相关服务是指我司及关联方通过合法拥有并运营的、标注名称为“${appName}”的快应用程序。
      2.关联方是指，指一方现在或将来控制、受控制或与其处于共同控制下的任何公司、机构以及上述公司或机构的法定代表人。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被依法认定的方式。
      3.去标识化是指，通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。
      4.匿名化是指，通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。
      （三）本“隐私政策”的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。
      生效日期：2022年10月1日 发布日期：2023年1月1日`;
const quickAppUserAgreement = ` &emsp;&emsp;生效时间：2023 年 3 月 1 日
      <br />
      &emsp;&emsp;更新时间：2022 年 3 月 1 日
      <br />
      &emsp;&emsp;欢迎您使用本快应用产品及服务!
      在此特别提醒您（用户）在使用本快应用之前，请认真阅读本《用户协议》（以下简称“本协议”），确保您充分理解本协议中各条款，特别是涉及免除或限制责任的条款、权利许可、法律适用和争议解决条款等。其中，重要内容将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用本快应用。请您审慎阅读并选择接受或不接受本协议。
      除非您接受本协议所有条款，否则您无权通过任何方式使用本快应用服务。若您使用本快应用及相关服务，则视为您已充分理解本协议，并承诺作为本协议的一方当事人接受本协议各项条款的约束。
      如您对本协议有任何疑问或建议，您可以通过产品中的“客服电话”、“投诉反馈”等方式联系我们。 一、
      定义 1、用户:
      指所有直接或间接获取和使用本快应用及相关服务的自然人、法人和其他组织等。在本协议中称为“用户”或称“您”。
      2、本快应用:
      指由我司合法拥有并运营快应用产品。本快应用并不是一个手机软件，而是一款免下载、免安装，基于中国安卓厂商快应用框架，类似于手机网页的新型产品服务。
      3、本协议:
      本协议内容同时包括我司已经发布及后续可能不断更新、修订或发布的关于本快应用及相关服务的相关协议、政策、规则等内容。
      二、本协议的服务范围与效力 本协议由您与我司在平等、友好的基础上共同订立,
      本协议对您与我司均具有法律约束力。
      协议补充条款说明：除本协议正文以外，订入本协议的内容还包括您在使用我司某一特定产品或服务时，该产品或服务可能会另有单独的协议、相关业务规则、说明、通用条款等（以下统称为“规则”）。所有我司已经发布的或将来可能发布的规则均为本协议不可分割的组成部分，与本协议具有同等法律效力。除另行明确声明外，任何我司服务均受本协议约束
      协议更新条款说明：您理解并同意，为了给您提供更好的服务体验，与行业惯常实践保持一致，我们将会在您使用平台服务的过程中，根据国家法律法规更新、业务功能的扩展不时地制订、修改本协议及各类规则，并以公示的方式向您告知前述规则的更新。您有权选择是否接受更新后的服务。如您继续使用我们的服务，即表示您接受经修订的协议和规则；如您对已生效的变更事项不同意的，您应当于变更事项确定的生效之日起主动停止使用本产品的服务，变更事项对您不产生效力，这可能导致部分补充功能和服务受到限制或无法使用；如发生有关争议时，您同意以我们最新的相关协议和规则为准。
      三、快应用服务内容 1、快应用的启动服务：
      快应用并非手机软件，而是一种由您的手机厂商提供的一种免下载、免安装的新型服务。具有消耗流量少、启动速度快的特点。您可以在快应用中心搜索本产品名字启动本产品，也可以通过点击本产品推广链接进行使用。您知晓、理解并认可快应用启动服务由手机厂商快应用引擎提供，并非由本快应用提供。
      需要您特别注意的是：如您在手机系统中前置同意了“快应用自动唤起服务”，您可能无需二次确认，即可跳转包括本快应用在内的所有快应用产品。您知晓、理解并认可该自动跳转能力由手机厂商快应用引擎提供，并非由本快应用提供。同时，您同意并接受由快应用引擎提供的所有快应用启动服务。
      在某些情况下，如您在手机系统中误操作打开了自动唤起服务，可能会对手机日常使用造成打扰。为此，您可以在本产品中的【帮助中心】-【启动服务】中查看如何在手机系统中关闭快应用的自动唤起。在您关闭后，所有快应用的打开，均需要经过您的二次确认。如果您仍不知道如何关闭，可以拨打手机厂商售后电话寻求协助。
      2、本快应用的服务内容：
      本快应用服务的具体内容由我司根据实际情况提供，以快应用打开后的实际情况为准。我司提供的服务内容可能会根据用户反馈进行迭代和变更，但为了让利用户，本快应用的所有版本，均提供完全免费的服务内容。可能包括但不限于免费小说阅读、免费天气预报、免费日历等服务。
      3、本快应用的广告服务：
      本快应用提供的所有服务永久免费，您知晓、理解并认可，我们为了向您免费提供服务，接入由您的手机厂商提供的广告。
      虽然本快应用中的广告经过手机厂商的严格审核，但作为产品开发者，我们无权干预广告展示内容。“手机话费类、盲盒类、手机清理、走路赚钱”等广告可能会造成您的经济损失。您在产品使用过程的广告浏览过程中，请务必注意提高警惕、注意辨别、理性消费。
      除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责。您知晓、理解并认可在使用本快应用过程时，在广告中的支付或下载行为，均出于您的个人意愿，如您有任何广告相关的疑问、售后或纠纷，请直接和产品广告主联系。本快应用不承担因为第三方广告造成的直接或者间接损失。您知晓、理解并认可在使用本快应用过程中，当您在Wi-Fi状态下时，方便您的体验，可能会出现点击广告软件后的安装，该部分能力由您的手机厂商广告SDK提供，本快应用并不具备点击后安装的能力。
      四、个人信息保护
      1、我们不会收集任何您的任何个人信息，除非由您主动提交。您可能会在提供建议主动填写手机号码。或者在使用金币兑换福利时，填写您的邮寄地址等。请您注意，所有您的个人信息，均在您主动提供的前提下，我们才会收集，是您真实的意愿表达。如您选择不提供，并不影响使用本快应用的基本服务，但可能会影响到产品反馈、福利邮寄等。
      2、尊重用户个人信息的私密性是我们的一贯制度，我们将采取技术措施和其他必要措施，确保用户个人信息安全，防止在本服务中收集的用户个人信息泄露、毁损或丢失。在发生前述情形或者发现存在发生前述情形的可能时，我们将及时采取补救措施并告知用户，用户如发现存在前述情形亦需立即与我们联系。
      3、我们承诺未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：
      (1)根据法律法规规定或有权机关的指示提供用户的个人隐私信息; (2)由于用户将其设备借用他人,
      由此导致的任何个人信息的泄漏, 或其他非因我司原因导致的个人隐私信息的泄露;
      (3)用户自行向第三方公开其个人隐私信息;
      (4)用户与我司及合作单位之间就用户个人隐私信息的使用公开达成约定，我司因此向合作单位公开用户个人隐私信息；
      (5)任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露;
      (6)用户个人信息已经经过处理无法识别特定个人且不能复原。
      4、用户同意我们可在以下事项中使用用户的个人信息: (1) 向用户及时发送重要通知,
      如快应用更新、本协议条款的变更; (2)
      我司内部进行数据分析和研究、向用户发放奖品等，以改进我司的产品、服务和与用户之间的沟通; (3)
      依本协议约定，我司管理、审查用户信息及进行处理所采取的措施; (4) 适用法律法规规定的其他事项。
      5、除上述事项外, 如未取得用户事先同意, 我们不会将用户个人隐私信息使用于任何其他用途。
      6、为了改善我们的技术和服务, 向用户提供更好的服务体验,
      我们或可会自行收集使用或向第三方提供用户的非个人隐私信息。
      7、我们保证在合法、正当与必要的原则下收集、使用或者公开用户个人信息且不会收集与提供的服务无关的用户个人信息。
      8、我们十分注重保护用户的个人隐私, 并制定了《隐私政策》, 用户亦可以通过《隐私政策》,
      用户确认并同意使用我司提供的服务将被视为接受《隐私政策》。 五、用户行为规范
      1、本条所述内容是指用户使用本服务过程中所制作、复制、发布、传播的任何内容,
      包括但不限于文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面,
      以及其他使用帐号或本服务所产生的内容。
      2、用户不得利用产品或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容: (1)
      违反宪法所确定的基本原则的; (2) 危害国家安全, 泄露国家秘密, 颠覆国家政权, 破坏国家统一的; (3)
      损害国家荣誉和利益的; (4) 煽动民族仇恨、民族歧视, 破坏民族团结的; (5) 破坏国家宗教政策,
      宣扬邪教和封建迷信的; (6) 散布谣言, 扰乱社会秩序, 破坏社会稳定的; (7)
      散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的; (8) 侮辱或者诽谤他人,
      侵害他人合法权益的; (9)
      不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的;
      (10) 含有法律、行政法规禁止的其他内容的信息。
      3、用户不得利用产品或本服务制作、上载、复制、发布、传播如下干扰产品正常运营,
      以及侵犯其他用户或第三方合法权益的内容: (1)含有任何性或性暗示的;
      (2)含有辱骂、恐吓、威胁内容的; (3)含有骚扰、垃圾广告、恶意信息、诱骗信息的;
      (4)涉及他人隐私、个人信息或资料的; (5)侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的;
      (6)含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。
      4、用户须对利用产品或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与我司无关。如因此给我们或第三方造成损害的，用户应当依法予以赔偿。
      5、除非我们书面许可，用户不得从事包括但不限于下列任一行为：
      (1) 删除快应用及其副本上关于著作权的信息；
      (2) 对快应用进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现快应用的源代码；
      (3) 对快应用或者快应用运行过程中释放到任何终端内存中的数据、快应用运行过程中客户端与服务器端的交互数据，以及快应用运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经我们授权的第三方工具/服务接入快应用和相关系统；
      (4) 通过修改或伪造快应用运行中的指令、数据，增加、删减、变动快应用的功能或运行效果，或者将用于上述用途的快应用、方法进行运营或向公众传播，无论这些行为是否为商业目的；
      (5)发表、传送、传播、储存包含病毒、木马、定时炸弹等可能对我司造成伤害或影响其稳定性的内容；未经我司许可使用任何第三方插件、外挂等工具导致影响我司正常运行收到干扰、破坏或者被施加其他影响；通过制造虚假身份、以误导、欺骗他人为目的发布虚假信息；违背我司页面公布之活动规则，通过作弊或通过其他手段进行虚假交易；对我司的任何数据作商业性利用，在未经我司事先书面同意的情况下，以复制、传播等任何方式使用我司展示的资料等；
      (6)进行任何侵犯知识产权及其他相关合法权益的行为，包括但不限于：通过自动化采集的方式大规模或频繁收集或处理我司提供产品,`;
export const appConfig = {
  default: {
    name: '漫漫风云阅读',
    privacyAgreementContent: quickAppPrivacyAgreement('漫漫风云阅读'),
    UserAgreementContent: quickAppUserAgreement,
  },
  package_1: {
    name: '风云阅读',
    privacyAgreementContent: quickAppPrivacyAgreement('风云阅读'),
    UserAgreementContent: quickAppUserAgreement,
  },
  package_2: {
    name: '摇钱树有宝',
    privacyAgreementContent: quickAppPrivacyAgreement('摇钱树有宝'),
    UserAgreementContent: quickAppUserAgreement,
  },
};
export const keys = Object.keys(appConfig);
export type TAppConfig = keyof typeof appConfig;
